In [1]:
#1. Import the necesarry elements to establish connection

import mysql.connector
from mysql.connector import Error

In [2]:
#1. establish connection with try/except

try:
  cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1')

except mysql.connector.Error as err:


  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)

In [5]:
#1. Confirm that connection was established correctly.

if cnx.is_connected():
    print("Connection to MySQL is successful!")
else:
    print("Connection failed.")

Connection to MySQL is successful!

In [8]:
mycursor.execute("SHOW DATABASES")
for db in mycursor:
    print(db)

('bbdd_alumnas',)
('biblioteca_adalab',)
('information_schema',)
('leccion-1-sql',)
('leccion-10-sql',)
('leccion-11-sql',)
('leccion-12-sql',)
('leccion-13-sql',)
('leccion-14-sql',)
('leccion-2-sql',)
('leccion-3-sql',)
('leccion-4-sql',)
('leccion-5-sql',)
('leccion-6-sql',)
('leccion-7-sql',)
('leccion-8-sql',)
('leccion-9-sql',)
('mi_ejercicio',)
('mydb',)
('mysql',)
('northwind',)
('performance_schema',)
('sakila',)
('sys',)
('tienda',)
('tienda_nueva',)
('tienda_zapatillas',)
('world',)

In [11]:
#2. Create a new database

mycursor = cnx.cursor()
mycursor.execute("CREATE DATABASE alumnas_promo_X")
print(mycursor)

CMySQLCursor: CREATE DATABASE alumnas_promo_X

In [18]:
#create a new table in that database 

mycursor = cnx.cursor()

mycursor.execute("USE alumnas_promo_X")


mycursor.execute("""
    CREATE TABLE alumnas (
    id_alumna INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(255) NOT NULL,
    apellido VARCHAR(255) NOT NULL,
    ciudad VARCHAR(100) DEFAULT NULL,
    telefono VARCHAR(15) DEFAULT NULL)
    """)

print(mycursor)

CMySQLCursor:
    CREATE TABLE alumnas (
    id_alumn..

In [21]:
#Insert 10 registros into the table alumnas

mycursor = cnx.cursor()
query = "INSERT INTO alumnas (id_alumna, name, apellido, ciudad, telefono) VALUES (%s, %s, %s, %s, %s)"
val = (1, "Ana", "Apple", "Madrid", "123456789")
mycursor.execute(query, val)
cnx.commit()

In [24]:
query = "INSERT INTO alumnas (name, apellido, ciudad, telefono) VALUES (%s, %s, %s, %s)"
val = ("Sara", "Lopez", "Paris", "203762205")
mycursor.execute(query, val)
cnx.commit()

In [ ]:
query = "INSERT INTO alumnas (name, apellido, ciudad, telefono) VALUES (%s, %s, %s, %s)"
val = [
("Elena", "Jones", "Paris", "20376789"),
("Joy", "Garcia", "Paris", "20376657"),
("Madison", "Rodriguez", "Paris", "567893203"),
("Libby", "Harris", "Paris", "675204729"),
("Cindy", "Taylor", "Paris", "879376240"),
("Erica", "Swift", "Paris", "656483202"),
("Emily", "Rogers", "Paris", "789043254"),
("Lenssa", "Trump", "Paris", "6783208432")
]
mycursor.executemany(query, val)
cnx.commit()

In [27]:
#5 show all results

mycursor = cnx.cursor()
mycursor.execute("SELECT * FROM alumnas")
myresult = mycursor.fetchall()
print(myresult)

[(1, 'Ana', 'Apple', 'Madrid', '123456789'), (2, 'Sara', 'Lopez', 'Paris', '203762205'), (3, 'Elena', 'Jones', 'Paris', '20376789'), (4, 'Joy', 'Garcia', 'Paris', '20376657'), (5, 'Madison', 'Rodriguez', 'Paris', '567893203'), (6, 'Libby', 'Harris', 'Paris', '675204729'), (7, 'Cindy', 'Taylor', 'Paris', '879376240'), (8, 'Erica', 'Swift', 'Paris', '656483202'), (9, 'Emily', 'Rogers', 'Paris', '789043254'), (10, 'Lenssa', 'Trump', 'Paris', '6783208432')]

In [29]:
mycursor = cnx.cursor()
mycursor.execute("SELECT * FROM alumnas")
myresult = mycursor.fetchall()

for x in myresult:
  print(x)

(1, 'Ana', 'Apple', 'Madrid', '123456789')
(2, 'Sara', 'Lopez', 'Paris', '203762205')
(3, 'Elena', 'Jones', 'Paris', '20376789')
(4, 'Joy', 'Garcia', 'Paris', '20376657')
(5, 'Madison', 'Rodriguez', 'Paris', '567893203')
(6, 'Libby', 'Harris', 'Paris', '675204729')
(7, 'Cindy', 'Taylor', 'Paris', '879376240')
(8, 'Erica', 'Swift', 'Paris', '656483202')
(9, 'Emily', 'Rogers', 'Paris', '789043254')
(10, 'Lenssa', 'Trump', 'Paris', '6783208432')

In [30]:
import pandas as pd

In [33]:
#show all results as a DataFrame, don't forget column names

df = pd.DataFrame(myresult, columns = ["id_alumna", "name", "apellido", "ciudad", "telefono"])

In [34]:
df

   id_alumna     name   apellido  ciudad    telefono
0          1      Ana      Apple  Madrid   123456789
1          2     Sara      Lopez   Paris   203762205
2          3    Elena      Jones   Paris    20376789
3          4      Joy     Garcia   Paris    20376657
4          5  Madison  Rodriguez   Paris   567893203
5          6    Libby     Harris   Paris   675204729
6          7    Cindy     Taylor   Paris   879376240
7          8    Erica      Swift   Paris   656483202
8          9    Emily     Rogers   Paris   789043254
9         10   Lenssa      Trump   Paris  6783208432

In [35]:
#Muestra los primeros y últimos 3 en un DataFrame

df.head(3)

   id_alumna   name apellido  ciudad   telefono
0          1    Ana    Apple  Madrid  123456789
1          2   Sara    Lopez   Paris  203762205
2          3  Elena    Jones   Paris   20376789

In [36]:
df.tail(3)

   id_alumna    name apellido ciudad    telefono
7          8   Erica    Swift  Paris   656483202
8          9   Emily   Rogers  Paris   789043254
9         10  Lenssa    Trump  Paris  6783208432

In [38]:
head = df.head(3)
tail = df.tail(3)

result = pd.concat([head, tail])

print(result)

   id_alumna    name apellido  ciudad    telefono
0          1     Ana    Apple  Madrid   123456789
1          2    Sara    Lopez   Paris   203762205
2          3   Elena    Jones   Paris    20376789
7          8   Erica    Swift   Paris   656483202
8          9   Emily   Rogers   Paris   789043254
9         10  Lenssa    Trump   Paris  6783208432